
imt = float(input("Введите ваш Индекс Массы Тела (ИМТ): "))

if imt < 16:
    print("Выраженный дефицит массы тела")
elif imt >= 16 and imt < 18.5:
    print("Недостаточная масса тела")
elif imt >= 18.5 and imt <= 24.99:
    print("Норма")
elif imt >= 25 and imt <= 29.99:
    print("Избыточная масса тела")
elif imt >= 30 and imt <= 34.99:
    print("Ожирение первой степени")
elif imt >= 35 and imt <= 39.99:
    print("Ожирение второй степени")
else: # Все значения >= 40 попадают сюда
    print("Ожирение третьей степени")