
print("Собака короткошерстной породы?")
if input() == "да":
    print("Рост собаки меньше 50 см?")
    if input() == "да":
        print("У собаки длинный хвост?")
        if input() == "да":
            print("Такса")
        else:
            print("Бульдог")
    else:
        print("Пекинес")
else:
    print("Себя собака принесла в зубах?")
    if input() == "да":
        print("Чихуахуа")
    else:
        print("Рост собаки меньше 60 см?")
        if input() == "да":
            print("Йоркширский терьер")
        else:
            print("Рост собаки менее 70 см?")
            if input() == "да":
                print("У собаки длинные уши?")
                if input() == "да":
                    print("Бассет-хаунд")
                else:
                    print("Колли")
            else:
                print("Вес собаки менее 45 кг?")
                if input() == "да":
                    print("Померанский шпиц")
                else:
                    print("У собаки добрый нрав?")
                    if input() == "да":
                        print("Сенбернар")
                    else:
                        print("Фила бразилейро")
